/*
Если хотите подумать, только чур не искать на просторах интернета: дана строка из скобок, например "( [] {} )[ ( { () } ) ]" .
В строке могут быть символы кроме скобок, они нас не интересуют. Как видите, скобки могут встречаться трех видов () [] {}
Необходимо проверить корректность расстановки скобок. Т.е. закрытые-открытые, вложенность и т.д.
Спойлер: задача несложная, важно придумать подход
Спойлер 2: простой подсчет скобок, как мы делали в классе вряд ли поможет
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}