/*
Написать программу, которая выводит на экран текст:

Мое имя: Андрей
Я живу в городе Берлин
Естественно, имя и город должны быть вашими.
 */
public class Main {
    public static void main(String[] args) {

        System.out.println("My name is Anna.");
        System.out.println("I live in Berlin.");

    }
}